Revit 2026 API

# RevitAPIPostDocEventArgs Class

---

The base class used for post events where the arguments must supply access to the document.

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitAPIEventArgs Autodesk.Revit.DB.EventsRevitAPIPostEventArgs Autodesk.Revit.DB.EventsRevitAPIPostDocEventArgs More

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RevitAPIPostDocEventArgs : RevitAPIPostEventArgs
```
```vb
Public Class RevitAPIPostDocEventArgs
	Inherits RevitAPIPostEventArgs
```
```cpp
public ref class RevitAPIPostDocEventArgs : public RevitAPIPostEventArgs
```
```fsharp
type RevitAPIPostDocEventArgs =
    class
        inherit RevitAPIPostEventArgs
    end
```

The RevitAPIPostDocEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | Document | The document associated with the event. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |
|  | Status | Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler). (Inherited from RevitAPIPostEventArgs) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from RevitAPIEventArgs) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCancelled | Indicates whether the event is being cancelled. (Inherited from RevitAPIEventArgs) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Events Namespace

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitAPIEventArgs Autodesk.Revit.DB.EventsRevitAPIPostEventArgs Autodesk.Revit.DB.EventsRevitAPIPostDocEventArgs Autodesk.Revit.DB.EventsDocumentCreatedEventArgs Autodesk.Revit.DB.EventsDocumentOpenedEventArgs Autodesk.Revit.DB.EventsDocumentPrintedEventArgs Autodesk.Revit.DB.EventsDocumentReloadedLatestEventArgs Autodesk.Revit.DB.EventsDocumentSavedAsEventArgs Autodesk.Revit.DB.EventsDocumentSavedEventArgs Autodesk.Revit.DB.EventsDocumentSynchronizedWithCentralEventArgs Autodesk.Revit.DB.EventsElementTypeDuplicatedEventArgs Autodesk.Revit.DB.EventsFamilyLoadedIntoDocumentEventArgs Autodesk.Revit.DB.EventsFileExportedEventArgs Autodesk.Revit.DB.EventsFileImportedEventArgs Autodesk.Revit.DB.EventsLinkedResourceOpenedEventArgs Autodesk.Revit.DB.EventsViewExportedEventArgs Autodesk.Revit.DB.EventsViewPrintedEventArgs Autodesk.Revit.DB.EventsViewsExportedByContextEventArgs Autodesk.Revit.UI.EventsViewActivatedEventArgs